In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('20130101', periods = 6)

In [7]:
df = pd.DataFrame(np.arange(24).reshape((6, 4)), index = dates, columns = ['A', 'B', 'C', 'D'])

In [8]:
df

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [10]:
df['A']

2013-01-01     0
2013-01-02     4
2013-01-03     8
2013-01-04    12
2013-01-05    16
2013-01-06    20
Freq: D, Name: A, dtype: int32

In [11]:
df.A

2013-01-01     0
2013-01-02     4
2013-01-03     8
2013-01-04    12
2013-01-05    16
2013-01-06    20
Freq: D, Name: A, dtype: int32

In [13]:
df[0:3]

            A  B   C   D
2013-01-01  0  1   2   3
2013-01-02  4  5   6   7
2013-01-03  8  9  10  11

In [14]:
df['20130102':'20130104']

             A   B   C   D
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15

In [15]:
df.loc['20130101']

A    0
B    1
C    2
D    3
Name: 2013-01-01 00:00:00, dtype: int32

In [16]:
df.loc[:, ['A', 'B']]

             A   B
2013-01-01   0   1
2013-01-02   4   5
2013-01-03   8   9
2013-01-04  12  13
2013-01-05  16  17
2013-01-06  20  21

In [19]:
df.loc['20130102':, ['A', 'B']]

             A   B
2013-01-02   4   5
2013-01-03   8   9
2013-01-04  12  13
2013-01-05  16  17
2013-01-06  20  21

In [20]:
df.iloc[3]

A    12
B    13
C    14
D    15
Name: 2013-01-04 00:00:00, dtype: int32

In [22]:
df.iloc[3:5, 1:3]

             B   C
2013-01-04  13  14
2013-01-05  17  18

In [23]:
df.ix[:3, ['A','C']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

            A   C
2013-01-01  0   2
2013-01-02  4   6
2013-01-03  8  10

In [24]:
df[df.A > 8]

             A   B   C   D
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [26]:
df.iloc[2, 2] = 11

In [27]:
df.iloc[2, 2]

11

In [28]:
df.F  =np.nan

In [29]:
df

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  11  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [30]:
df['F'] = np.nan

In [31]:
df

             A   B   C   D   F
2013-01-01   0   1   2   3 NaN
2013-01-02   4   5   6   7 NaN
2013-01-03   8   9  11  11 NaN
2013-01-04  12  13  14  15 NaN
2013-01-05  16  17  18  19 NaN
2013-01-06  20  21  22  23 NaN

In [36]:
df.dropna(axis = 0, how = 'any')

Empty DataFrame
Columns: [A, B, C, D, F]
Index: []

In [37]:
df = pd.DataFrame(np.arange(24).reshape((6, 4)), index = dates, columns = ['A', 'B', 'C', 'D'])

In [38]:
df.fillna(value = 0)

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [39]:
df.iloc[0, 0] = np.nan

In [40]:
df

               A   B   C   D
2013-01-01   NaN   1   2   3
2013-01-02   4.0   5   6   7
2013-01-03   8.0   9  10  11
2013-01-04  12.0  13  14  15
2013-01-05  16.0  17  18  19
2013-01-06  20.0  21  22  23

In [41]:
df.fillna(value = 0)

               A   B   C   D
2013-01-01   0.0   1   2   3
2013-01-02   4.0   5   6   7
2013-01-03   8.0   9  10  11
2013-01-04  12.0  13  14  15
2013-01-05  16.0  17  18  19
2013-01-06  20.0  21  22  23